// --------------------------------------------
var name;
var userNames = [];
// --------------------------------------------
for (var count = 0; count < 5; count++) {
name = prompt('Введите имена пользователей '+ (count+1)+' из 5'+':', '');
userNames.push(name);
}
// --------------------------------------------
  var login = prompt('Для входа введите имя пользователя:', '');
  // --------------------------------------------
  for (var i = 0; i < userNames.length; i++) {
    if (login === userNames[i]) {
      var enter = true; // --------------------------------------------
      break; // --------------------------------------------
    }
  }
  // --------------------------------------------
  if (enter) {
      alert(login + ', вы успешно вошли');
  } else {
    alert('Access denied!');
  }
